In [32]:
import pandas as pd

In [33]:
student_data = [
    ['홍길동',80,70,80],
    ['박철수',60,70,80],
    ['김영희',70,90,80]
]
df = pd.DataFrame(student_data)
df.columns = ["이름",'국어','수학','영어']
df

    이름  국어  수학  영어
0  홍길동  80  70  80
1  박철수  60  70  80
2  김영희  70  90  80

In [43]:
df["국어"]

0    80
1    60
2    70
Name: 국어, dtype: int64

In [44]:
df.iloc[0]

이름    홍길동
국어     80
수학     70
영어     80
Name: 0, dtype: object

In [70]:
df["사회"] = [50,60,70]
df

    이름  국어  수학   영어  사회
0  홍길동  80  70   80  50
1  박철수  60  70  100  60
2  김영희  70  90   80  70

In [71]:
df = df.drop("사회",axis = 1)
df

    이름  국어  수학   영어
0  홍길동  80  70   80
1  박철수  60  70  100
2  김영희  70  90   80

In [72]:
df.loc[1,"이름"]

'박철수'

In [73]:
df.loc[1,"영어"] = 100
df

    이름  국어  수학   영어
0  홍길동  80  70   80
1  박철수  60  70  100
2  김영희  70  90   80

In [95]:
#비교하는법 1
df[(df["국어"]>=70) & (df["수학"]>=80)]

#비교하는법 2
df.query("국어>=70 and 수학>=80")

    이름  국어  수학  영어
2  김영희  70  90  80

In [98]:
df.query("국어>=80 or 영어>=80")

    이름  국어  수학   영어
0  홍길동  80  70   80
1  박철수  60  70  100
2  김영희  70  90   80

In [111]:
#df = df.set_index("이름")
df

     국어  수학   영어
이름
홍길동  80  70   80
박철수  60  70  100
김영희  70  90   80

In [126]:
print(df.loc["홍길동","국어"])

80

In [128]:
df.sum()
#하나의 열의 합을 찾고싶으면 df["columns"].sum()

국어    210
수학    230
영어    260
dtype: int64

In [131]:
df.sum(axis=1)
#axis는 사용하지 않아도 값이 출력되지만 항상 열고정이기 때문에 행값이 필요하면 axis=1로 지정해주면 좋다.
#그러면 문제없이 출력된다. 열은 적지않아도 합산값이 나온다.

이름
홍길동    230
박철수    230
김영희    240
dtype: int64

In [139]:
dfsum = df["국어"] +df["수학"] +df["영어"]
df["합계"] = dfsum
df

     국어  수학   영어   합계
이름
홍길동  80  70   80  230
박철수  60  70  100  230
김영희  70  90   80  240

In [142]:
a = pd.Series(data=[100,100,100],index=["국어","수학","영어"])

In [147]:
df.loc["박세찬"] = a
df.isnull()
df.isnull().sum()

국어    0
수학    0
영어    0
합계    1
dtype: int64

In [150]:
df.rename(columns = {"합계":"총점"})
dfsum = df["국어"] +df["수학"] +df["영어"]
df["합계"] = dfsum
df

        국어     수학     영어     합계
이름
홍길동   80.0   70.0   80.0  230.0
박철수   60.0   70.0  100.0  230.0
김영희   70.0   90.0   80.0  240.0
박세찬  100.0  100.0  100.0  300.0

In [ ]:
ex3_data = ori.copy()
ex3_data.loc[:,"데이터"] = ex3_data.loc[:,"데이터"].replace("-",0).astype(int)

In [ ]:
filter0 = (ex3_data["시점"]>="2024.1/4")# & (ex3_data["시점"]< "2019.1/4") # 파이썬은 날짜도 부등호로 계산할 수 있다.
ex3_data = ex3_data[filter0]
ex3_data.head(20)

In [ ]:
x_data = ex3_data[ex3_data["연령계층별"].isin(["20 - 29세"])]
#x_data.loc[:,"데이터"] = x_data.loc[:,"데이터"].astype(int)

y_data = ex3_data[ex3_data["연령계층별"].isin(["60세이상"])]
#y_data.loc[:,"데이터"] = y_data.loc[:,"데이터"].astype(int)

z_data = ex3_data
#z_data.loc[:,"데이터"] = z_data.loc[:,"데이터"].astype(int)
x = x_data.groupby("시도별")["데이터"].sum()#.reset_index(name="total") #20대 취업자
y = y_data.groupby("시도별")["데이터"].sum()#.reset_index(name="total") #60대(정년퇴직) 취업자
z = z_data.groupby("시도별")["데이터"].sum()#.reset_index(name="total")
x

In [ ]:
import numpy as np

regions = list(x["시도별"]) #라벨
regions
colors = [np.random.rand(3,) for _ in range(len(regions))] # 랜덤색상 color

In [ ]:
fig , ax = plt.subplots(figsize=(12,5))
z = np.array(z, dtype=float)
scatter = ax.scatter(x,y,s=z*0.5,c=colors,alpha = 0.5)

for n in range(len(regions)):
    ax.annotate(regions[n],xy=(x.iloc[n], y.iloc[n]),ha = "center")

ax.plot([0,4000],[0,4000], color="r", linestyle="--", linewidth=2)

ax.set_title("2024년 전국 청년과 60세 이상 취업자수 관계")
ax.set_xlabel("청년 취업자")
ax.set_ylabel("60세 이상 취업자")
#ax.set_slabel
plt.show()